[M_Ep5_ThePhoenix MissionDefinition]
MissionName="The fire is burning"
MissionDescription="To defeat Jack, you must find a warrior named Roland. If you are looking for Roland's security, you can find his current address.."
TurnInDescription="Lilith, known as Firehawk, tells Roland that she has been kidnapped by a bandit who has invaded her land. You have to save him."
MissionSummary="get firehawk."
MissionGiver="bus ride"
MissionTurnInLocation="fire extinguisher"
TeaserText=""

[M_Ep5_ThePhoenix:CrossNarrowBridgeSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Ep5_ThePhoenix:EnterBanditCampset MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Ep5_ThePhoenix:EnterCaveSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Ep5_ThePhoenix:ExitCavesSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Ep5_ThePhoenix:FindFink MissionObjectiveDefinition]
ProgressMessage="Turn on the radio."

[M_Ep5_ThePhoenix:FindFireHawkCave MissionObjectiveDefinition]
ProgressMessage="Follow the red eyes"

[M_Ep5_ThePhoenix:FindFireHawkCaveSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Ep5_ThePhoenix:FindPhoenix MissionObjectiveDefinition]
ProgressMessage="look for electric door"

[M_Ep5_ThePhoenix:FirstBloodshotSignSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Ep5_ThePhoenix:GiveEridium MissionObjectiveDefinition]
ProgressMessage="Give Iridium to Lilith."

[M_Ep5_ThePhoenix:GiveEridiumSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Ep5_ThePhoenix:GoToCanyon MissionObjectiveDefinition]
ProgressMessage="Visit Frostburn Mall"

[M_Ep5_ThePhoenix:GoToIceCanyonSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="To defeat Jack, you must find a hero named Roland. He disappears, but you find something: Roland Hunter before Farhak arrives..<br>If you find this fiery owl [place]Frostburn Valley[-place], You can meet Roland.."

[M_Ep5_ThePhoenix:GotoRolandsSafe MissionObjectiveDefinition]
ProgressMessage="Uses Roland's protection"

[M_Ep5_ThePhoenix:GrabEridium MissionObjectiveDefinition]
ProgressMessage="Use of iridium blocks"

[M_Ep5_ThePhoenix:GrabEridiumSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Help Lilith get rid of red eyes.."
MissionDescriptionOverride="To defeat Jack, you must find a warrior named Roland. He's not here, but you're right: there's a dangerous Firehawk named Roland before you..<br>So, Firehawk, thanks [place]Frostburn Discussion[-place], He was alone with Lilith, Roland's queen. It is yours; If you can remove the remaining red eye between you, he will give you a clue to find Roland. The vampire gives the medicine to the thief, and the priest is satisfied, you will be asked to guide him.."

[M_Ep5_ThePhoenix:HelpLilithDefeatBandits MissionObjectiveDefinition]
ProgressMessage="The thief wins."

[M_Ep5_ThePhoenix:HelpLilithDefeatBanditsSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="To defeat Jack, you need to find a soldier named Roland. He's gone, but there's a clue: a fearsome hunter named Firehawk, who was called Roland before he came..<br>Turns out the Firehawk is where you got it [place]Valley of Ice Burns[-place], It was none other than Lilith, Chemer's old radio and Roland's friend. They claim to be on your side. If you can clear the remaining red eyes from the two of you, he'll give you the information you need to find Roland.."

[M_Ep5_ThePhoenix:InsideCaveSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Ep5_ThePhoenix:LastWaveGiveEridium MissionObjectiveDefinition]
ProgressMessage="Release of lithium iridium"

[M_Ep5_ThePhoenix:LastWaveGiveEridiumSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="To defeat Jack, you must find a warrior named Roland. Even if you don't see it, you have an idea: Before you get there, out comes a dangerous fighter named Firehawk Roland..<br>Looks like you have a Firehawk [place]Frostburn Valley[-place], It was Lilith who opened the secret chamber in the past and met Roland. He helped the fighters with the equipment, but now it's time to ask where Roland is.."

[M_Ep5_ThePhoenix:LastWaveGrabEridium MissionObjectiveDefinition]
ProgressMessage="Take the iridium ingot"

[M_Ep5_ThePhoenix:LastWaveGrabEridiumSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="To defeat Jack and stop the hero, you must find a soldier named Roland. You go, but you have an idea. You are Roland, the fearsome hunter known as Firehawk..<br>He seems obsessed with Firehawk. [place]Frostburn Valley[-place], He is none other than Lilith, Chamberlain, and Roland's companion. You destroyed society, and now Lilith needs your help. After the war ended, she was already exhausted. Tell him to bring me more iridium.."

[M_Ep5_ThePhoenix:ReviveLilith MissionObjectiveDefinition]
ProgressMessage="hello lamia"

[M_Ep5_ThePhoenix:ReviveLilithSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Bring the vampire back to life.."
MissionDescriptionOverride="In order to defeat Jack, you must find a warrior named Roland. He's gone, but you only know one thing: before you arrived, there lived a fearsome hunter named Roland, nicknamed "The Firehawk.".<br>This may be the Firehawk you know. [place]The burn pit is ice[-place], This visitor was none other than Lilith, the ancient palace explorer that Roland had spoken to. He talks to you; if you can open the red eye between them, it will give you the information you need to find Roland.."

[M_Ep5_ThePhoenix:RolandSafeSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Ep5_ThePhoenix:SpeaktoFireHawkSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Ep5_ThePhoenix:WitnessBloodshotsSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

